youseetoo/uc2-esp32/main/src/scanner/HighSpeedScannerCore.cpp
/**
 * @file HighSpeedScannerCore.cpp
 * @brief High-speed galvo scanner core implementation
 * 
 * Based on LASERSCANNER standalone project.
 * Uses printf for guaranteed serial output.
 */

#include "HighSpeedScannerCore.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_task_wdt.h"
#include "driver/gpio.h"
#include "soc/gpio_struct.h"
#include "esp_rom_sys.h"
#include "soc/soc_caps.h"
// Hardware pixel clock needs RMT finite TX loop count (ESP32-S3; not classic
// ESP32). IDF >= 5 provides driver/rmt_tx.h; the IDF 4.4-based Arduino core
// only has the legacy driver/rmt.h, which exposes the same loop-count feature
// via rmt_set_tx_loop_count() + autostop.
#if SOC_RMT_SUPPORT_TX_LOOP_COUNT
#if __has_include("driver/rmt_tx.h")
#define GALVO_RMT_NEW_API 1
#include "driver/rmt_tx.h"
#elif __has_include("driver/rmt.h")
#define GALVO_RMT_LEGACY_API 1
#include "driver/rmt.h"
// Use the last TX-capable channel to avoid colliding with libraries that
// allocate from 0 upwards (e.g. NeoPixel)
#define GALVO_RMT_CHANNEL RMT_CHANNEL_3
#endif
#endif
// Widest line the RMT can clock in a single armed train. The hardware TX loop
// counter is 10-bit on the ESP32-S3 (RMT_LL_MAX_LOOP_COUNT in hal/rmt_ll.h —
// a private HAL header we deliberately don't include here, so mirror it).
// Lines longer than this fall back to software pixel pulses.
#define GALVO_RMT_MAX_LOOP_COUNT 1023
#include <cmath>
#include <cstring>
#include <stdio.h>
#include <new>

static const char* TAG = "Scanner";

// Use printf for guaranteed output
#define SCANNER_LOG(fmt, ...) printf("[%s] " fmt "\n", TAG, ##__VA_ARGS__)

HighSpeedScannerCore::HighSpeedScannerCore()
{
    config_mutex_ = xSemaphoreCreateMutex();
    // Line profile buffer is allocated in init(); buildLineProfile() no-ops
    // until then, so CAN masters that never init() stay memory-free.

    // Initialize arbitrary point buffer with default center point
    arbitrary_points_[0] = ArbitraryScanPoint(2048, 2048, 1000);
    arbitrary_point_count_ = 0;  // Start with no points (disabled)
}

HighSpeedScannerCore::~HighSpeedScannerCore()
{
    stop();
    disableHwPixelClock();
    if (task_handle_) {
        vTaskDelete(task_handle_);
        task_handle_ = nullptr;
    }
    if (config_mutex_) {
        vSemaphoreDelete(config_mutex_);
    }
    delete[] line_x_;
    delete[] x_map_;
}

bool HighSpeedScannerCore::init(DAC_MCP4822* dac, int trigger_pin_pixel,
                                 int trigger_pin_line, int trigger_pin_frame,
                                 int laser_pin)
{
    SCANNER_LOG("init() called with pins: pixel=%d, line=%d, frame=%d, laser=%d",
                trigger_pin_pixel, trigger_pin_line, trigger_pin_frame, laser_pin);

    if (!dac) {
        SCANNER_LOG("ERROR: DAC pointer is null");
        return false;
    }

    dac_ = dac;
    trigger_pin_pixel_ = trigger_pin_pixel;
    trigger_pin_line_ = trigger_pin_line;
    trigger_pin_frame_ = trigger_pin_frame;
    laser_pin_ = laser_pin;

    // Allocate the line profile buffer (slave/hardware nodes only reach here;
    // CAN masters never call init() and stay at zero DRAM cost)
    if (!line_x_) {
        line_x_ = new (std::nothrow) uint16_t[SCANNER_MAX_LINE_SAMPLES];
        if (!line_x_) {
            SCANNER_LOG("ERROR: line profile buffer allocation failed");
            return false;
        }
    }

    // Configure trigger pins and the laser gate pin
    uint64_t pin_mask = 0;
    if (trigger_pin_pixel_ >= 0) pin_mask |= (1ULL << trigger_pin_pixel_);
    if (trigger_pin_line_ >= 0) pin_mask |= (1ULL << trigger_pin_line_);
    if (trigger_pin_frame_ >= 0) pin_mask |= (1ULL << trigger_pin_frame_);
    if (laser_pin_ >= 0) pin_mask |= (1ULL << laser_pin_);

    if (pin_mask != 0) {
        gpio_config_t io = {};
        io.intr_type = GPIO_INTR_DISABLE;
        io.mode = GPIO_MODE_OUTPUT;
        io.pin_bit_mask = pin_mask;
        io.pull_down_en = GPIO_PULLDOWN_DISABLE;
        io.pull_up_en = GPIO_PULLUP_DISABLE;
        gpio_config(&io);

        if (trigger_pin_pixel_ >= 0) gpio_set_level((gpio_num_t)trigger_pin_pixel_, 0);
        if (trigger_pin_line_ >= 0) gpio_set_level((gpio_num_t)trigger_pin_line_, 0);
        if (trigger_pin_frame_ >= 0) gpio_set_level((gpio_num_t)trigger_pin_frame_, 0);
        if (laser_pin_ >= 0) gpio_set_level((gpio_num_t)laser_pin_, 0);

        SCANNER_LOG("Pins configured: Pixel=GPIO%d, Line=GPIO%d, Frame=GPIO%d, Laser=GPIO%d",
                    trigger_pin_pixel_, trigger_pin_line_, trigger_pin_frame_, laser_pin_);
    }

    buildLineProfile();

    // Park mirrors at start position
    SCANNER_LOG("Parking mirrors at x=%d, y=%d", config_.x_min, config_.y_min);
    dac_->setX(config_.x_min);
    dac_->setY(config_.y_min);
    dac_->ldacPulse();

    SCANNER_LOG("Initialized: %dx%d, X=[%d,%d], Y=[%d,%d]",
                config_.nx, config_.ny, config_.x_min, config_.x_max, 
                config_.y_min, config_.y_max);
    return true;
}

bool HighSpeedScannerCore::setConfig(const ScanConfig& config)
{
    // Validate configuration. In bidirectional mode there is no flyback
    // (odd lines scan backwards), so fly_samples does not contribute.
    uint32_t line_total = (uint32_t)config.pre_samples +
                          2u * config.overscan_samples + config.nx +
                          (config.bidirectional ? 0 : config.fly_samples) +
                          config.line_settle_samples;
    
    SCANNER_LOG("setConfig: nx=%d, ny=%d, x=[%d,%d], y=[%d,%d], period=%dus, frames=%d",
                config.nx, config.ny, config.x_min, config.x_max,
                config.y_min, config.y_max, config.sample_period_us, config.frame_count);
    
    if (config.nx == 0 || config.ny == 0) {
        SCANNER_LOG("ERROR: Invalid nx or ny (both must be > 0)");
        return false;
    }
    
    if (line_total == 0 || line_total > SCANNER_MAX_LINE_SAMPLES) {
        SCANNER_LOG("ERROR: Line total %lu out of range (max %d)", 
                    (unsigned long)line_total, SCANNER_MAX_LINE_SAMPLES);
        return false;
    }
    
    if (config.x_min >= config.x_max || config.y_min >= config.y_max) {
        SCANNER_LOG("ERROR: Invalid range");
        return false;
    }
    
