youseetoo/uc2-esp32/main/src/scanner/HighSpeedScannerCore.cpp
    BaseType_t ret = xTaskCreatePinnedToCore(
        taskWrapper,
        "galvo_scanner",
        8192,  // Increased from 4096 to prevent stack overflow with arbitrary point arrays
        this,
        priority,
        &task_handle_,
        core_id
    );

    if (ret == pdPASS) {
        task_created_ = true;
        SCANNER_LOG("Scanner task created successfully");
        return true;
    } else {
        SCANNER_LOG("ERROR: Failed to create scanner task");
        return false;
    }
}

void HighSpeedScannerCore::stopTask()
{
    if (task_handle_) {
        vTaskDelete(task_handle_);
        task_handle_ = nullptr;
        task_created_ = false;
        SCANNER_LOG("Scanner task stopped and deleted");
    }
}

void HighSpeedScannerCore::scannerTask()
{
    SCANNER_LOG("Scanner task started on core %d", xPortGetCoreID());
    
    // Subscribe this task to the watchdog - we'll reset it periodically
    // Note: IDLE0 watchdog is disabled in sdkconfig for galvo builds
    // but we keep the scanner task watched for safety
    esp_err_t wdt_err = esp_task_wdt_add(NULL);
    if (wdt_err == ESP_OK) {
        SCANNER_LOG("Scanner task added to watchdog");
    } else {
        SCANNER_LOG("Watchdog add returned %d (may already be added or not initialized)", wdt_err);
    }

    while (true) {
        // Reset watchdog at start of each iteration
        esp_task_wdt_reset();

        if (!running_) {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        // Check if config changed - restart frame with new config
        xSemaphoreTake(config_mutex_, portMAX_DELAY);
        bool cfg_changed = config_changed_;
        config_changed_ = false;
        ScanMode current_mode = scan_mode_;
        xSemaphoreGive(config_mutex_);
        
        if (cfg_changed) {
            SCANNER_LOG("Config changed - restarting scan");
            frame_idx_ = 0;
            line_idx_ = 0;
            overruns_ = 0;
        }

        // Route to appropriate scan implementation based on mode
        if (current_mode == SCAN_MODE_ARBITRARY) {
            executeArbitraryPointScan();
            
            // Check if we should continue looping
            frame_idx_++;
            xSemaphoreTake(config_mutex_, portMAX_DELAY);
            uint16_t fc = config_.frame_count;
            xSemaphoreGive(config_mutex_);
            
            if (fc != 0 && frame_idx_ >= fc) {
                running_ = false;
                SCANNER_LOG("Arbitrary point scan completed %d frames", fc);
            }
            
            taskYIELD();
            vTaskDelay(1);
            continue;
        }
        else if (current_mode == SCAN_MODE_RASTER)
        {       
        // RASTER SCAN MODE
        // Snapshot configuration for this frame
        ScanConfig cfg;
        xSemaphoreTake(config_mutex_, portMAX_DELAY);
        cfg = config_;
        uint16_t line_len = line_len_;
        uint32_t img_start = img_start_;
        uint32_t img_end = img_end_;
        xSemaphoreGive(config_mutex_);

        if (line_len == 0 || cfg.nx == 0 || cfg.ny == 0) {
            SCANNER_LOG("Invalid configuration, stopping");
            running_ = false;
            continue;
        }

        // Hardware pixel clock lifecycle (RMT owns the pixel pin while active).
        // One RMT symbol must carry a >= 1 us high and a >= 1 us low half (a
        // 0-duration half is an end marker), so the dwell needs >= 2 us; and the
        // hardware loop counter is 10-bit, so a line may be at most 1023 pixels.
        // Outside that envelope we leave the RMT off and the software pulse path
        // below takes over — otherwise the pixel trigger would vanish entirely.
        const bool want_hw_clock = (cfg.hw_pixel_clock != 0) &&
                                   (cfg.sample_period_us >= 2) &&
                                   (cfg.nx <= GALVO_RMT_MAX_LOOP_COUNT);
        if (want_hw_clock && !hw_clock_active_) enableHwPixelClock();
        if (!want_hw_clock && hw_clock_active_) disableHwPixelClock();
        const bool hw_clock = hw_clock_active_;

        // Log frame start (only every 100 frames to avoid spam)
        if (frame_idx_ % 100 == 0) {
            SCANNER_LOG("Frame %lu starting, bidirectional=%d, hw_clock=%d",
                        (unsigned long)frame_idx_, cfg.bidirectional, (int)hw_clock);
        }

        const bool bidir = (cfg.bidirectional != 0);
        const bool do_trig = (cfg.enable_trigger != 0);
        const bool do_laser = (cfg.laser_blanking != 0) && (laser_pin_ >= 0);
        // Pixel pulse width (software mode): honour trig_width_us but always
        // leave at least half the dwell for the DAC update; 0 keeps the legacy
        // register-fast pulse (tens of ns)
        uint16_t pix_width_us = cfg.trig_width_us;
        if (cfg.sample_period_us > 0 && pix_width_us > cfg.sample_period_us / 2) {
            pix_width_us = cfg.sample_period_us / 2;
        }

        // Scan all lines (Y steps)
        for (uint16_t ly = 0; ly < cfg.ny && running_ && !config_changed_; ++ly) {
            line_idx_ = ly;

            // Bidirectional: odd lines use the mirrored profile. Trigger and
            // laser windows use the SAME sample indices in both directions.
            const bool reverse_line = bidir && (ly & 1);

            // Compute Y position - lock only for the computation
            xSemaphoreTake(config_mutex_, portMAX_DELAY);
            uint16_t y12 = computeY(ly);
            bool do_lut = (config_.apply_x_lut != 0) && x_map_valid_;
            uint16_t sp_us = config_.sample_period_us;
            xSemaphoreGive(config_mutex_);

            // Set Y position once per line
            dac_->setY(y12);
            dac_->ldacPulse();

            // LINE/FRAME MARKERS at line start (during the pre-blanking hold,
            // where the DAC is static and there is timing slack). The frame
            // marker leads the line marker by trig_delay_us; both lead the
            // first pixel by (pre_samples + overscan_samples) * dwell, which
            // the acquisition side models as offset_left / trigger delay.
            if (do_trig) {
                uint16_t marker_width = cfg.trig_width_us ? cfg.trig_width_us : 1;
                if (ly == 0 && trigger_pin_frame_ >= 0) {
                    GPIO.out_w1ts = (1U << trigger_pin_frame_);
                    esp_rom_delay_us(marker_width);
                    GPIO.out_w1tc = (1U << trigger_pin_frame_);
                    if (cfg.trig_delay_us) esp_rom_delay_us(cfg.trig_delay_us);
                }
                if (trigger_pin_line_ >= 0) {
                    GPIO.out_w1ts = (1U << trigger_pin_line_);
                    esp_rom_delay_us(marker_width);
                    GPIO.out_w1tc = (1U << trigger_pin_line_);
                }
            }

            int64_t next_t = esp_timer_get_time();

            // Diagnostics: trace the first couple of lines of the first frame
            // so a stall shows exactly where it happened in the serial log,
            // instead of only the coarse "line=N" from the 5s status ticker.
            const bool trace_line = (frame_idx_ == 0 && ly < 2);

            // Scan one line
            for (uint32_t i = 0; i < line_len && running_ && !config_changed_; ++i) {
                next_t += sp_us;

                // TIMING CONTROL: wait until the exact periodic instant
                int64_t now;
                while (true) {
                    now = esp_timer_get_time();
                    if (now >= next_t) {
                        break;
                    }
                }

