youseetoo/uc2-esp32/main/src/scanner/HighSpeedScannerCore.cpp
                // Check for timing overrun (loop too slow)
                int64_t overrun_us = now - next_t;
                if (overrun_us > (int64_t)sp_us) {
                    overruns_++;
                }

                // Feed the task watchdog and yield periodically WITHIN the
                // line, not just once per completed line. With the default
                // sample_period_us the DAC/SPI update alone can exceed the
                // configured period (see GALVO_FLIM_TIMING_REVIEW.md F3), and
                // any single blocking call in this inner loop (SPI, RMT, GPIO)
                // previously had no escape hatch before the 5s task watchdog
                // timeout - this bounds the blast radius and keeps the WDT fed
                // even while a slow/stalled line is still in progress.
                if ((i & 0x3F) == 0) {
                    esp_task_wdt_reset();
                }

                // IMAGING WINDOW ENTRY: open laser gate, arm hardware clock
                if (i == img_start) {
                    if (do_laser) setLaserGate(true);
                    if (do_trig && hw_clock) {
                        if (trace_line) SCANNER_LOG("  line %d: arming hw pixel clock (i=%lu)", ly, (unsigned long)i);
                        // RMT emits exactly nx hardware-timed pulses
                        armHwPixelClock(cfg.nx, sp_us, cfg.trig_width_us);
                        if (trace_line) SCANNER_LOG("  line %d: hw pixel clock armed", ly);
                    }
                }

                // PIXEL TRIGGER (software fallback): equidistant pacing comes
                // from next_t; width honours trig_width_us (capped at dwell/2)
                if (do_trig && !hw_clock && (i >= img_start) && (i < img_end) &&
                    trigger_pin_pixel_ >= 0) {
                    GPIO.out_w1ts = (1U << trigger_pin_pixel_);
                    if (pix_width_us) esp_rom_delay_us(pix_width_us);
                    GPIO.out_w1tc = (1U << trigger_pin_pixel_);
                }

                // IMAGING WINDOW EXIT: close laser gate
                if (do_laser && i == img_end) {
                    setLaserGate(false);
                }

                // DAC UPDATE with remaining time budget
                // Odd bidirectional lines: mirror around the ramp center on
                // the fly (one subtraction; keeps the reverse profile without
                // a second 8 KB buffer)
                uint16_t x12 = reverse_line
                    ? clamp12(mirror_sum_ - (int32_t)line_x_[i])
                    : line_x_[i];
                if (do_lut) x12 = applyXMap(x12);
                dac_->setX(x12);
                dac_->ldacPulse();
            }

            // Safety: never leave the laser on across line boundaries
            // (img_end == line_len when there is no post-imaging region)
            if (do_laser) setLaserGate(false);

            // Reset watchdog and yield after each line to prevent timeout
            esp_task_wdt_reset();
            if (sp_us == 0) {
                taskYIELD();  // Brief yield at max speed - not vTaskDelay to maintain speed
            }
        }

        // If config changed mid-frame, restart immediately
        if (config_changed_) {
            SCANNER_LOG("Config changed mid-frame, restarting");
            continue;
        }

        frame_idx_++;

        // Check frame count (0 = infinite)
        xSemaphoreTake(config_mutex_, portMAX_DELAY);
        uint16_t fc = config_.frame_count;
        xSemaphoreGive(config_mutex_);
        
        if (fc != 0 && frame_idx_ >= fc) {
            SCANNER_LOG("Completed %lu frames, stopping", (unsigned long)frame_idx_);
            running_ = false;
        }
        
        // Yield to IDLE task between frames to prevent watchdog timeout
        // This allows other tasks to run briefly without impacting scan timing
        taskYIELD();
        vTaskDelay(1); // 1 tick delay between frames to keep watchdog happy
    }
}
}

void HighSpeedScannerCore::executeArbitraryPointScan()
{
    // Snapshot point buffer - only allocate space for actual points to save stack
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    uint16_t point_count = arbitrary_point_count_;
    if (point_count > SCANNER_MAX_ARBITRARY_POINTS) point_count = SCANNER_MAX_ARBITRARY_POINTS;
    
    // Allocate only needed points on stack instead of full 256-point array
    ArbitraryScanPoint* points = (ArbitraryScanPoint*)alloca(point_count * sizeof(ArbitraryScanPoint));
    for (uint16_t i = 0; i < point_count; ++i) {
        points[i] = arbitrary_points_[i];
    }
    xSemaphoreGive(config_mutex_);

    if (point_count == 0) {
        SCANNER_LOG("No arbitrary points configured, skipping");
        vTaskDelay(pdMS_TO_TICKS(100));
        return;
    }

    // Log start (only every 100 frames)
    if (frame_idx_ % 100 == 0) {
        SCANNER_LOG("Arbitrary point scan frame %lu: %d points", (unsigned long)frame_idx_, point_count);
    }

    // Initialize trigger state based on mode
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    TriggerMode trig_mode = trigger_mode_;
    xSemaphoreGive(config_mutex_);

    // Set initial trigger state for continuous mode
    if (trig_mode == TRIGGER_CONTINUOUS || trig_mode == TRIGGER_HIGH) {
        setTriggerState(true);
    } else {
        setTriggerState(false);
    }

    // Scan all points in sequence
    for (uint16_t pt_idx = 0; pt_idx < point_count && running_ && !config_changed_; ++pt_idx) {
        const ArbitraryScanPoint& pt = points[pt_idx];
        
        // Apply X correction LUT if enabled
        uint16_t x12 = pt.x;
        xSemaphoreTake(config_mutex_, portMAX_DELAY);
        bool do_lut = (config_.apply_x_lut != 0) && x_map_valid_;
        xSemaphoreGive(config_mutex_);
        
        if (do_lut) {
            x12 = applyXMap(x12);
        }
        
        uint16_t y12 = pt.y;
        
        // Trigger LOW during movement (unless continuous/manual override)
        if (trig_mode == TRIGGER_AUTO) {
            setTriggerState(false);
        }
        
        // Move to position
        dac_->setX(x12);
        dac_->setY(y12);
        dac_->ldacPulse();
        
        // Short settling time after movement (allow galvos to reach position)
        // Use minimal delay to not waste time
        esp_rom_delay_us(1);
        
        // Trigger HIGH during dwell (unless manual override to LOW)
        if (trig_mode == TRIGGER_AUTO || trig_mode == TRIGGER_CONTINUOUS) {
            setTriggerState(true);
        }
        
        // Dwell at position
        if (pt.dwell_us > 0) {
            // Use precise timing
            int64_t dwell_start = esp_timer_get_time();
            int64_t dwell_end = dwell_start + pt.dwell_us;
            
            while (esp_timer_get_time() < dwell_end && running_ && !config_changed_) {
                // Busy wait for precise timing
                // For very long dwells, could add periodic yields
                if (pt.dwell_us > 10000) {  // > 10ms
                    taskYIELD();
                }
            }
        }
        
        // Reset watchdog periodically
        if (pt_idx % 10 == 0) {
            esp_task_wdt_reset();
        }
    }

    // Trigger LOW at end of scan (unless continuous/manual override)
    if (trig_mode == TRIGGER_AUTO) {
        setTriggerState(false);
    }
}
